# (if/elif/else)

# По номеру месяца вывести кол-во дней в нем (без указания названия месяца, в феврале 28 дней)
# Результат проверки вывести на консоль
# Если номер месяца некорректен - сообщить об этом

# Номер месяца получать от пользователя следующим образом
user_input = input("Введите, пожалуйста, номер месяца: ")
month = int(user_input)
print('Вы ввели', month)

# TODO здесь ваш код
if 0 < month <= 12:
    if month <= 7:
        if month % 2 == 1:
            print(31)
        else:
            if month == 2:
                print(28)
            else:
                print(30)
    elif month % 2 == 0:
        print(31)
    else:
        print(30)


else:
    print('Нет такого месяца')