from lesson_005.painting import sun, rainbow, building, wood
import simple_draw as sd

sd.resolution = (1200, 600)


def draw_pic():
    sun.draw_sun()
    rainbow.draw_rainbow()
    building.draw_house()
    building.draw_ground()
    wood.draw_branches_v2(point=sd.get_point(950, 30),angle=90, length=80)


if __name__ == '__main__':
    draw_pic()
    sd.pause()
# Создать пакет, в который скопировать функции отрисовки из предыдущего урока
#  - радуги
#  - стены
#  - дерева
# Функции по модулям разместить по тематике. Название пакета и модулей - по смыслу.
# Создать модуль с функцией отрисовки кирпичного дома с широким окном и крышей.

# С помощью созданного пакета нарисовать эпохальное полотно "Утро в деревне".
# На картине должны быть:
#  - кирпичный дом, в окошке - смайлик.
#  - слева от дома - сугроб (предположим что это ранняя весна)
#  - справа от дома - дерево (можно несколько)
#  - справа в небе - радуга, слева - солнце (весна же!)
# пример см. lesson_005/results/04_painting.jpg
# Приправить своей фантазией по вкусу (коты? коровы? люди? трактор? что придумается)

# TODO здесь ваш код
