from pprint import pprint


# Добавить булочку для гамбургеров из пшеничной муки
def add_bun():
    pprint('Берём булочку для гамбургеров')


# Добавить бифштексы из говядины рубленые
def add_cutlets():
    pprint('А теперь добавим котлету')


# Добавить огурцы маринованные резаные
def add_cucumbers():
    pprint('А теперь добавим маринованные огурцы')


# Добавить свежий помидор
def add_tomato():
    pprint('А теперь добавим помидор')


# Добавить майонез
def add_mayo():
    pprint('А теперь добавим майонез')


# Добавить кетчуп томатный
def add_ketchup():
    pprint('А теперь добавим кетчуп')


# Добавить лук репчатый резаный
def add_onion():
    pprint('А теперь добавим репчатый лук')


# Добавить плавленый сыр Чеддер
def add_cheese():
    pprint('А теперь добавим сыр Чеддер')


# Добавить горчичный соус
def add_mustard():
    pprint('А теперь добавим горчичный соус')
